<?php
// В цьому файлі визначаємо методи доступу до інформації із БД

function get_categories() {    //створюємо функцію витягання інформації про категорії і передаємо параметр $link ,який відповідає за підключення до БД
    
    global $link;
    
    $sql = "SELECT * FROM categories"; // Записуємо sql-запит для витягання потрібної інформації
    
    $results = mysqli_query($link, $sql); // Записуємо отримані дані із БД в змінну, але дані тут представлені не в повній мірі, показано тільки скільки існує стовпців і рядків
    
    $categories = mysqli_fetch_all($results, MYSQLI_ASSOC); //витягуємо корисну інформацію використовуючи як параметр загальну інформацію отриману попередньою функцією і записуємо її як масив даних. MYSQLI_ASSOC - ця константа повертає значення індексів масиву так як вони записані БД (тобто не [0][1],[1][Подорожі], а [id][1],[title][Подорожі])
    
    return $categories; 
}

function get_posts() {    //створюємо функцію витягання інформації про категорії і передаємо параметр $link ,який відповідає за підключення до БД
    
    global $link;
    
    $sql = "SELECT * FROM posts"; 
    
    $results = mysqli_query($link, $sql); 
    
    $posts = mysqli_fetch_all($results, MYSQLI_ASSOC); 
    
    return $posts; 
}

